# DWFImportOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DWFImportOptions Members
DWFImportOptions Class Constructors Methods Properties See Also
---
The DWFImportOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DWFImportOptions(DWFImportOptions) | Constructs a new instance of DWFImportOptions as a copy of the import options. |
| DWFImportOptions(IList<(Of <<'(ElementId>)>>)) | Constructs a new instance of DWFImportOptions with an array of imported sheet views. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the DWFImportOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSheetViews | Get sheet views where DWF markups are imported. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetSheetViews | Set sheet views where DWF markups are imported. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DWFImportOptions Class
Autodesk.Revit.DB Namespace